[
  {
    "id": 1,
    "title": "Software Engineering Intern @ Fluxo Consultoria",
    "startMonth": "Jun",
    "startYear": 2023,
    "endMonth": "Jan",
    "endYear": 2024,
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "responsibilities": [
      "Collaborated directly with clients to understand business needs and transform their ideas into fully functional systems.",
      "Worked with a multidisciplinary team of undergraduate engineers to design system architectures, define technical requirements, and develop user-friendly applications from scratch.",
      "Participated in the entire product lifecycle—from initial requirements gathering and database modeling to visual identity design and backend implementation."
    ],
    "highlights": [
      "Requirements engineering",
      "Database modeling",
      "Backend API development with NestJS",
      "Client communication & project delivery"
    ],
    "impact": [
      "Delivered complete software solutions that enabled clients to digitize and scale their business operations.",
      "Improved team project workflows through clear documentation and collaboration strategies.",
      "Strengthened consulting soft skills through client interaction and iterative development cycles."
    ],
    "tech": [
      {
        "id": 1,
        "title": "NestJS",
        "icon": "SiNestjs",
        "stack": "backend"
      },
      {
        "id": 2,
        "title": "PostgreSQL",
        "icon": "SiPostgresql",
        "stack": "backend"
      },
      {
        "id": 3,
        "title": "Figma",
        "icon": "SiFigma",
        "stack": "frontend"
      }
    ]
  },
  {
    "id": 2,
    "title": "Machine Learning Researcher @ GTA-UFRJ",
    "startMonth": "Jun",
    "startYear": 2024,
    "endMonth": "Jan",
    "endYear": 2025,
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "responsibilities": [
      "Researched and developed a computer vision module for a real-time security monitoring system, capable of detecting and classifying camera interference or obstruction attempts.",
      "Designed a custom dataset and trained machine learning models using OpenCV and Scikit-learn, achieving approximately 96% accuracy in obstruction classification.",
      "Integrated the ML module into a legacy backend system developed in pure Python, ensuring seamless communication with the broader application infrastructure."
    ],
    "highlights": [
      "Computer vision for security systems",
      "Dataset creation & model evaluation",
      "Backend integration without frameworks"
    ],
    "impact": [
      "Enhanced the robustness of the security system by enabling proactive detection of camera tampering.",
      "Achieved high model accuracy while optimizing for real-time inference performance.",
      "Contributed to an academic research initiative within one of UFRJ's leading engineering laboratories."
    ],
    "tech": [
      {
        "id": 4,
        "title": "Python",
        "icon": "SiPython",
        "stack": "datascience"
      },
      {
        "id": 5,
        "title": "OpenCV",
        "icon": "SiOpencv",
        "stack": "datascience"
      },
      {
        "id": 6,
        "title": "Scikit-learn",
        "icon": "SiScikitlearn",
        "stack": "datascience"
      }
    ]
  },
  {
    "id": 3,
    "title": "Spatial Audio Researcher @ UFRJ",
    "startMonth": "Sep",
    "startYear": 2025,
    "endMonth": "Present",
    "endYear": "",
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "responsibilities": [
      "Investigating the principles of Ambisonics (First-Order and Higher-Order) and spherical harmonics to enhance audio precision for immersive simulations.",
      "Researching the feasibility of developing a custom 360° video player optimized for high-precision spatial audio rendering (HOA).",
      "Developed and validated an end-to-end software pipeline for multiplexing 4-channel First-Order Ambisonics (FOA) audio with 360° video for the YouTube platform.",
      "Engineered the FOA workflow using DaVinci Resolve for multitrack audio configuration and the Spatial Media Metadata Injector to 'flag' files for binaural rendering.",
      "Conducting validation tests to troubleshoot playback inconsistencies, differentiating between file-level encoding and player-side rendering issues."
    ],
    "highlights": [
      "Architectural acoustics & psychoacoustics research",
      "Higher-Order Ambisonics (HOA) viability analysis",
      "First-Order Ambisonics (FOA) pipeline development",
      "Custom 360° video player feasibility study",
      "Playback validation & troubleshooting"
    ],
    "impact": [
      "Developing a simulation tool for architectural acoustics to study how sound in built environments affects human emotion (stress, joy, etc.).",
      "The research aims to replace costly, in-person environmental studies by enabling professionals to record a location once and conduct remote psychoacoustic tests online.",
      "Created a validated, replicable process for publishing immersive 360° audio content on major streaming platforms.",
      "Successfully diagnosed playback inconsistencies by differentiating between file-level encoding errors and player-side rendering issues."
    ],
    "tech": [
      {
        "id": 7,
        "title": "DaVinci Resolve",
        "icon": "SiDavinciresolve",
        "stack": "backend"
      }
    ]
  }
]